Config/InformationRegisters/СообщенияАвторизацииЕСМВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СообщенияАвторизацииЕСМВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторизацияЗапрос</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторизацияОтвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторизацияУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенИзОтвета</Name>
					<Comment>Токен может быть зашифрован, тогда требуется расшифровка закрытым ключем сертификата</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Comment>Расшифрованный токен, использующийся при обмене с сервисами ЕБП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГУИДАвторизации</Name>
					<Comment>Уникальный идентификатор записи регистра</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/CommonModules/ИнтеграцияЕСМВВызовСервера/Ext/Module.bsl
Функция ПройтиАвторизацию(Организация, ГУИДАвторизации, НастройкиУчастника, ТребуетсяРасшифровка=Ложь) Экспорт
	//В ЕБП токен действует 24 часа, 86400 секунд.
	//На всякий случай ограничим время, после которого будем авторизоваться повторно как 23 часа (23*60*60 = 82800).
	
	//Сейчас в ЕБП есть проблема с обменом, если авторизация была давно, поэтому пока авторизоваться будем всегда.
	//Прошлое значение времени жизни токена - 82800
	
	ВремяЖизниТокена = 0;//82800;
	Возврат ИнтеграцияЕСМВ.ПройтиАвторизациюЕСМВ(Организация, НастройкиУчастника, ГУИДАвторизации, ВремяЖизниТокена, ТребуетсяРасшифровка);
КонецФункции 

Процедура ЗаписатьРасшифрованныйТокен(РасшифрованныеДанные, Организация, ГУИДАвторизации, ТокенАвторизации) Экспорт 
	
	Если ТипЗнч(РасшифрованныеДанные) = Тип("Строка") Тогда
		//адрес временного хранилища
		ДД = ПолучитьИзВременногоХранилища(РасшифрованныеДанные);
	Иначе
		ДД = РасшифрованныеДанные;
	КонецЕсли;
	
	Поток = ДД.ОткрытьПотокДляЧтения();
	ЧтениеТекста = Новый ЧтениеТекста(Поток);
	ТокенАвторизации = ЧтениеТекста.Прочитать();
	
	ТипТокена = ИнтеграцияЕСМВКлиентСервер.ТипАвторизацииТокена();
	// При обмене с ЕСМВ используется тип авторизации Bearer, он должен быть указан в токене.
	// Укажем сами, если он не указан:
	Если СтрНайти(ТокенАвторизации, ТипТокена) = 0 Тогда
		ТокенАвторизации = ТипТокена + ТокенАвторизации;
	КонецЕсли;  
   
	ЗаписьСообщенияАвторизации = РегистрыСведений.СообщенияАвторизацииЕСМВ.СоздатьМенеджерЗаписи();
	ЗаписьСообщенияАвторизации.Организация = Организация;
	ЗаписьСообщенияАвторизации.ГУИДАвторизации = ГУИДАвторизации;
	ЗаписьСообщенияАвторизации.Прочитать();
	Если ЗаписьСообщенияАвторизации.Выбран() Тогда
		ЗаписьСообщенияАвторизации.ТокенАвторизации = ТокенАвторизации;
		ЗаписьСообщенияАвторизации.Записать();
	КонецЕсли;  
	
КонецПроцедуры 

Процедура ЗаписатьОшибкуРасшифровки(Организация, ГУИДАвторизации, ТекстОшибки) Экспорт
	ЗаписьСообщенияАвторизации = РегистрыСведений.СообщенияАвторизацииЕСМВ.СоздатьМенеджерЗаписи();
	ЗаписьСообщенияАвторизации.Организация = Организация;
	ЗаписьСообщенияАвторизации.ГУИДАвторизации = ГУИДАвторизации;
	ЗаписьСообщенияАвторизации.Прочитать();
	Если ЗаписьСообщенияАвторизации.Выбран() Тогда
		ЗаписьСообщенияАвторизации.ЕстьОшибка = Истина;
		ЗаписьСообщенияАвторизации.ТекстОшибки = ТекстОшибки;
		ЗаписьСообщенияАвторизации.Записать();
	КонецЕсли;
КонецПроцедуры   

Процедура ОтправитьОтмеченныеДокументы(ПараметрыОтправки) Экспорт
	ИнтеграцияЕСМВ.ОтправитьОтмеченныеДокументы(ПараметрыОтправки);
КонецПроцедуры 

Процедура ЗапроситьРезультатыОбработки(ПараметрыОтправки) Экспорт
	ИнтеграцияЕСМВ.ЗапроситьРезультатыОбработки(ПараметрыОтправки);
КонецПроцедуры    

Процедура ЗапроситьДокументыИзЕСМВ(ПараметрыОтправки) Экспорт
	ИнтеграцияЕСМВ.ЗапроситьДокументыИзЕСМВ(ПараметрыОтправки);
КонецПроцедуры    

Функция ПолучитьКлючЗаписиНастройкиОрганизаций(Организация) Экспорт
	 Возврат ИнтеграцияЕСМВ.ПолучитьКлючЗаписиНастройкиОрганизаций(Организация)
КонецФункции
